docs/slide.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>自學科學家系的日常 入坑 spacemacs</title>
<meta name="author" content="(jefferysac)"/>
<link rel="stylesheet" href="file:////Users/mac/projects/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="file:////Users/mac/projects/reveal.js/css/theme/black.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
<meta name="description" content="Title">
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">自學科學家系的日常 入坑 spacemacs</h1><h2 class="author">jefferysac</h2><p class="date">Created: 2017-08-04 Fri 13:14</p>
</section>
<section>
<section id="slide-orgb829112">
<h2 id="orgb829112">speech structure</h2>
<aside class="notes">
<p>
Enter speaker notes here.
</p>

</aside>
</section>
</section>
<section>
<section id="slide-org10cfc26">
<h3 id="org10cfc26">science , college to self-study</h3>
<div class="outline-text-3" id="text-org10cfc26">
</div></section>
<section id="slide-org8736b99">
<h4 id="org8736b99">magic</h4>
<p>
魔法
</p>
</section>
<section id="slide-org875135e">
<h4 id="org875135e">our education system "standard"</h4>
</section>
<section id="slide-org058d705">
<h4 id="org058d705">default option college</h4>
</section>
<section id="slide-org879cf07">
<h4 id="org879cf07">self-study college</h4>
<ul>
<li>I choose how to use my resource</li>

</ul>
</section>
<section id="slide-org7de0994">
<h4 id="org7de0994">cafe shop</h4>
</section>
<section id="slide-orga3f5ee8">
<h4 id="orga3f5ee8">internet study</h4>
</section>
</section>
<section>
<section id="slide-org9b481ed">
<h3 id="org9b481ed">org-mode GTD workflow</h3>
<div class="outline-text-3" id="text-org9b481ed">
</div></section>
<section id="slide-org37b3bdc">
<h4 id="org37b3bdc">notes?</h4>
</section>
<section id="slide-orgdf0cd0f">
<h4 id="orgdf0cd0f">org-capture</h4>
</section>
<section id="slide-orgf1d9b1e">
<h4 id="orgf1d9b1e">kanban key word</h4>
</section>
<section id="slide-orgfd622be">
<h4 id="orgfd622be">projectile</h4>
</section>
<section id="slide-org610b3e4">
<h4 id="org610b3e4">sync with magit</h4>
</section>
</section>
<section>
<section id="slide-org1699fe8">
<h3 id="org1699fe8">community to spacemacs</h3>
<div class="outline-text-3" id="text-org1699fe8">
</div></section>
<section id="slide-org90e0970">
<h4 id="org90e0970">emacs community</h4>
</section>
<section id="slide-org3606095">
<h4 id="org3606095">自己開心最重要了，愛怎樣綁就怎樣綁</h4>
</section>
<section id="slide-org38eebc9">
<h4 id="org38eebc9">testing</h4>
<ul class="org-ul"><li><a id="org595e7ce"></a>once there is a guy who start as emacser but end up in vim .reason is that he forget his emacs setting.<br /><p>
從前有一個人原本用 Emacs，但後來卻跑去用 Vim 了，原因是他搞丟了他的 Emacs 設定檔 ，
</p></li>
<li><a id="org94f97e1"></a>那個人叫做 Tim O'Reilly&#x2026;<br /><ul>
<li><a href="http://archive.oreilly.com/pub/a/oreilly/ask_tim/1999/unix_editor.html">oreilly</a></li>

</ul></li></ul>
</section>
<section id="slide-orgd69722d">
<h4 id="orgd69722d">adobe font</h4>
<ul>
<li><a href="https://github.com/pakastin/open-source-flash">Petition to open source Flash and Shockwave spec</a></li>

</ul>
</section>
</section>
<section>
<section id="slide-orgc393ec5">
<h3 id="orgc393ec5">suspicious , paranoid doubt.</h3>
<p>
only half of what you hear is true. learning is to discover that and then to ignore the rest.
</p>
</section>
</section>
<section>
<section id="slide-orgf85fc57">
<h3 id="orgf85fc57">open source to government</h3>
<div class="outline-text-3" id="text-orgf85fc57">
</div></section>
<section id="slide-org79fdb75">
<h4 id="org79fdb75">we need more resource</h4>
</section>
<section id="slide-orgc5fcfe4">
<h4 id="orgc5fcfe4">apple</h4>
<p>
<a href="https://technews.tw/2017/07/19/apple-cracking-down-on-vpn-based-ad-blockers-that-work-in-third-party-apps/">蘋果擬全面封殺 VPN 式 AdBlock</a>
<a href="https://www.macrumors.com/2017/07/14/apple-ad-blocking-app-crackdown/">Apple Cracking Down on VPN-Based Ad Blockers That Work in Third-Party Apps</a>
</p>
</section>
<section id="slide-orgf16bc22">
<h4 id="orgf16bc22">facebook</h4>
</section>
</section>
<section>
<section id="slide-org231763f">
<h3 id="org231763f">publish through hexo</h3>
</section>
</section>
<section>
<section id="slide-orgcb6a8fc">
<h3 id="orgcb6a8fc">slides</h3>
<p>
<a href="https://github.com/yjwen/org-reveal">Reveal.js and Org-Reveal</a> 
</p>
</section>
<section id="slide-org966ca7d">
<h4 id="org966ca7d">how it works?</h4>
</section>
<section id="slide-org7c59fd2">
<h4 id="org7c59fd2">margin</h4>
</section>
<section id="slide-org3fa140c">
<h4 id="org3fa140c">theme</h4>
</section>
</section>
<section>
<section id="slide-org960a55c">
<h3 id="org960a55c">COSCUP here you are</h3>
</section>
</section>
<section>
<section id="slide-orga5c93f8">
<h3 id="orga5c93f8">after</h3>

</section>
</section>
<section>
<section id="slide-org8ffe1c5">
<h3 id="org8ffe1c5">passion and star ring</h3>
<p>
but everything has price 
pay less could gain big
and here is cram school
and then each different group 
</p>
</section>
</section>
</div>
</div>
<script src="file:////Users/mac/projects/reveal.js/lib/js/head.min.js"></script>
<script src="file:////Users/mac/projects/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: false,
slideNumber: 'c',
rollingLinks: true,
keyboard: true,
overview: true,
width: 1600,
height: 400,
margin: 0.10,
minScale: 0.50,
maxScale: 1.50,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'file:////Users/mac/projects/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'file:////Users/mac/projects/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:////Users/mac/projects/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:////Users/mac/projects/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'file:////Users/mac/projects/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
